MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MNDGBG/mcu.h
typedef struct st_dmac1 {
	void          *DMSAR;
	void          *DMDAR;
	unsigned long  DMCRA;
	unsigned short DMCRB;
	char           wk0[2];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DCTG : 2;
			unsigned short  : 6;
			unsigned short SZ : 2;
			unsigned short  : 2;
			unsigned short DTS : 2;
			unsigned short MD : 2;
#else
			unsigned short MD : 2;
			unsigned short DTS : 2;
			unsigned short  : 2;
			unsigned short SZ : 2;
			unsigned short  : 6;
			unsigned short DCTG : 2;
#endif
	} BIT;
	} DMTMD;
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DARIE : 1;
			unsigned char SARIE : 1;
			unsigned char RPTIE : 1;
			unsigned char ESIE : 1;
			unsigned char DTIE : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char DTIE : 1;
			unsigned char ESIE : 1;
			unsigned char RPTIE : 1;
			unsigned char SARIE : 1;
			unsigned char DARIE : 1;
#endif
	} BIT;
	} DMINT;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short DARA : 5;
			unsigned short  : 1;
			unsigned short DM : 2;
			unsigned short SARA : 5;
			unsigned short  : 1;
			unsigned short SM : 2;
#else
			unsigned short SM : 2;
			unsigned short  : 1;
			unsigned short SARA : 5;
			unsigned short DM : 2;
			unsigned short  : 1;
			unsigned short DARA : 5;
#endif
	} BIT;
	} DMAMD;
	char           wk2[6];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTE : 1;
#endif
	} BIT;
	} DMCNT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SWREQ : 1;
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char CLRS : 1;
			unsigned char  : 3;
			unsigned char SWREQ : 1;
#endif
	} BIT;
	} DMREQ;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ESIF : 1;
			unsigned char  : 3;
			unsigned char DTIF : 1;
			unsigned char  : 2;
			unsigned char ACT : 1;
#else
			unsigned char ACT : 1;
			unsigned char  : 2;
			unsigned char DTIF : 1;
			unsigned char  : 3;
			unsigned char ESIF : 1;
#endif
	} BIT;
	} DMSTS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DISEL : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DISEL : 1;
#endif
	} BIT;
	} DMCSL;
} st_dmac1_t;

typedef struct st_doc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OMS : 2;
			unsigned char DCSEL : 1;
			unsigned char  : 1;
			unsigned char DOPCIE : 1;
			unsigned char DOPCF : 1;
			unsigned char DOPCFCL : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char DOPCFCL : 1;
			unsigned char DOPCF : 1;
			unsigned char DOPCIE : 1;
			unsigned char  : 1;
			unsigned char DCSEL : 1;
			unsigned char OMS : 2;
#endif
	} BIT;
	} DOCR;
	char           wk0[1];
	unsigned short DODIR;
	unsigned short DODSR;
} st_doc_t;

typedef struct st_drw2d {
	union {
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LIM1EN : 1;
			unsigned long LIM2EN : 1;
			unsigned long LIM3EN : 1;
			unsigned long LIM4EN : 1;
			unsigned long LIM5EN : 1;
			unsigned long LIM6EN : 1;
			unsigned long QUAD1EN : 1;
			unsigned long QUAD2EN : 1;
			unsigned long QUAD3EN : 1;
			unsigned long LIM1TH : 1;
			unsigned long LIM2TH : 1;
			unsigned long LIM3TH : 1;
			unsigned long LIM4TH : 1;
			unsigned long LIM5TH : 1;
			unsigned long LIM6TH : 1;
			unsigned long BAND1EN : 1;
			unsigned long BAND2EN : 1;
			unsigned long UNION12 : 1;
			unsigned long UNION34 : 1;
			unsigned long UNION56 : 1;
			unsigned long UNIONAB : 1;
			unsigned long UNIONCD : 1;
			unsigned long SPANABT : 1;
			unsigned long SPANSTR : 1;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long SPANSTR : 1;
			unsigned long SPANABT : 1;
			unsigned long UNIONCD : 1;
			unsigned long UNIONAB : 1;
			unsigned long UNION56 : 1;
			unsigned long UNION34 : 1;
			unsigned long UNION12 : 1;
			unsigned long BAND2EN : 1;
			unsigned long BAND1EN : 1;
			unsigned long LIM6TH : 1;
			unsigned long LIM5TH : 1;
			unsigned long LIM4TH : 1;
			unsigned long LIM3TH : 1;
			unsigned long LIM2TH : 1;
			unsigned long LIM1TH : 1;
			unsigned long QUAD3EN : 1;
			unsigned long QUAD2EN : 1;
			unsigned long QUAD1EN : 1;
			unsigned long LIM6EN : 1;
			unsigned long LIM5EN : 1;
			unsigned long LIM4EN : 1;
			unsigned long LIM3EN : 1;
			unsigned long LIM2EN : 1;
			unsigned long LIM1EN : 1;
#endif
	} BIT;
		} CONTROL;
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BSYENUM : 1;
			unsigned long BSYWR : 1;
			unsigned long CACHEDTY : 1;
			unsigned long DLSTACT : 1;
			unsigned long ENUIR : 1;
			unsigned long DLIR : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long DLIR : 1;
			unsigned long ENUIR : 1;
			unsigned long DLSTACT : 1;
			unsigned long CACHEDTY : 1;
			unsigned long BSYWR : 1;
			unsigned long BSYENUM : 1;
#endif
	} BIT;
		} STATUS;
	};
	union {
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PTNEN : 1;
			unsigned long TEXENA : 1;
			unsigned long PTNSRCL5 : 1;
			unsigned long USEACB : 1;
			unsigned long RDFMT2 : 2;
			unsigned long BSFA : 1;
			unsigned long BDFA : 1;
			unsigned long WRFMT2 : 1;
			unsigned long BSF : 1;
			unsigned long BDF : 1;
			unsigned long BSI : 1;
			unsigned long BDI : 1;
			unsigned long BC2 : 1;
			unsigned long TEXCLPX : 1;
			unsigned long TEXCLPY : 1;
			unsigned long TEXFILTX : 1;
			unsigned long TEXFILTY : 1;
			unsigned long RDFMT : 2;
			unsigned long WRFMT : 2;
			unsigned long WRALPHA : 2;
			unsigned long RLEEN : 1;
			unsigned long CLUTEN : 1;
			unsigned long COLKEYEN : 1;
			unsigned long CLUTFORM : 1;
			unsigned long BSIA : 1;
			unsigned long BDIA : 1;
			unsigned long RLEPIXW : 2;
#else
			unsigned long RLEPIXW : 2;
			unsigned long BDIA : 1;
			unsigned long BSIA : 1;
			unsigned long CLUTFORM : 1;
			unsigned long COLKEYEN : 1;
			unsigned long CLUTEN : 1;
			unsigned long RLEEN : 1;
			unsigned long WRALPHA : 2;
			unsigned long WRFMT : 2;
			unsigned long RDFMT : 2;
			unsigned long TEXFILTY : 1;
			unsigned long TEXFILTX : 1;
			unsigned long TEXCLPY : 1;
			unsigned long TEXCLPX : 1;
			unsigned long BC2 : 1;
			unsigned long BDI : 1;
			unsigned long BSI : 1;
			unsigned long BDF : 1;
			unsigned long BSF : 1;
			unsigned long WRFMT2 : 1;
			unsigned long BDFA : 1;
			unsigned long BSFA : 1;
			unsigned long RDFMT2 : 2;
			unsigned long USEACB : 1;
			unsigned long PTNSRCL5 : 1;
			unsigned long TEXENA : 1;
			unsigned long PTNEN : 1;
#endif
	} BIT;
		} CONTROL2;
		union {
			unsigned long LONG;
			struct {
				
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long REV : 12;
			unsigned long  : 5;
			unsigned long DLR : 1;
			unsigned long FBCACHE : 1;
			unsigned long TXCACHE : 1;
			unsigned long PERFCNT : 1;
			unsigned long TEXCLUT : 1;
			unsigned long  : 1;
			unsigned long RLEUNIT : 1;
			unsigned long TEXCLUT256 : 1;
			unsigned long COLKEY : 1;
			unsigned long  : 1;
			unsigned long ACBLD : 1;
			unsigned long  : 4;
#else
			unsigned long  : 4;
			unsigned long ACBLD : 1;
			unsigned long  : 1;
			unsigned long COLKEY : 1;
			unsigned long TEXCLUT256 : 1;
			unsigned long RLEUNIT : 1;
			unsigned long  : 1;
			unsigned long TEXCLUT : 1;
			unsigned long PERFCNT : 1;
			unsigned long TXCACHE : 1;
			unsigned long FBCACHE : 1;
			unsigned long DLR : 1;
			unsigned long  : 5;
			unsigned long REV : 12;
#endif
	} BIT;
		} HWVER;
	};
	char           wk0[8];
	unsigned long  L1START;
	unsigned long  L2START;
	unsigned long  L3START;
	unsigned long  L4START;
	unsigned long  L5START;
	unsigned long  L6START;
	unsigned long  L1XADD;
	unsigned long  L2XADD;
	unsigned long  L3XADD;
	unsigned long  L4XADD;
	unsigned long  L5XADD;
	unsigned long  L6XADD;
	unsigned long  L1YADD;
	unsigned long  L2YADD;
	unsigned long  L3YADD;
	unsigned long  L4YADD;
	unsigned long  L5YADD;
	unsigned long  L6YADD;
	unsigned long  L1BAND;
	unsigned long  L2BAND;
	char           wk1[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long COL1B : 8;
			unsigned long COL1G : 8;
			unsigned long COL1R : 8;
			unsigned long COL1A : 8;
#else
			unsigned long COL1A : 8;
			unsigned long COL1R : 8;
			unsigned long COL1G : 8;
			unsigned long COL1B : 8;
#endif
	} BIT;
	} COLOR1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long COL2B : 8;
			unsigned long COL2G : 8;
			unsigned long COL2R : 8;
			unsigned long COL2A : 8;
#else
			unsigned long COL2A : 8;
			unsigned long COL2R : 8;
			unsigned long COL2G : 8;
			unsigned long COL2B : 8;
#endif
	} BIT;
	} COLOR2;
	char           wk2[8];
	unsigned long  PATTERN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long X : 16;
			unsigned long Y : 16;
#else
			unsigned long Y : 16;
			unsigned long X : 16;
#endif
	} BIT;
	} SIZE;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PITCH : 16;
			unsigned long SSD : 16;
#else
			unsigned long SSD : 16;
			unsigned long PITCH : 16;
#endif
	} BIT;
	} PITCH;
	unsigned long  ORIGIN;
	char           wk3[12];
	unsigned long  LUST;
	unsigned long  LUXADD;
	unsigned long  LUYADD;
	unsigned long  LVSTI;
	unsigned long  LVSTF;
	unsigned long  LVXADDI;
	unsigned long  LVYADDI;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LVXADDF : 16;
			unsigned long LVYADDF : 16;
#else
			unsigned long LVYADDF : 16;
			unsigned long LVXADDF : 16;
#endif
	} BIT;
	} LVYXADDF;
	char           wk4[4];
	unsigned long  TEXPITCH;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TEXUMSK : 11;
			unsigned long TEXVMSK : 21;
#else
			unsigned long TEXVMSK : 21;
			unsigned long TEXUMSK : 11;
#endif
	} BIT;
	} TEXMSK;
	unsigned long  TEXORG;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ENUIREN : 1;
			unsigned long DLIREN : 1;
			unsigned long ENUIRCLR : 1;
			unsigned long DLIRCLR : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long DLIRCLR : 1;
			unsigned long ENUIRCLR : 1;
			unsigned long DLIREN : 1;
			unsigned long ENUIREN : 1;
#endif
	} BIT;
	} IRQCTL;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CENFX : 1;
			unsigned long CFLUFX : 1;
			unsigned long CENTX : 1;
			unsigned long CFLUTX : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long CFLUTX : 1;
			unsigned long CENTX : 1;
			unsigned long CFLUFX : 1;
			unsigned long CENFX : 1;
#endif
	} BIT;
	} CACHECTL;
	unsigned long  DLISTST;
	unsigned long  PERFCNT1;
	unsigned long  PERFCNT2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TRG1 : 16;
			unsigned long TRG2 : 16;
#else
			unsigned long TRG2 : 16;
			unsigned long TRG1 : 16;
#endif
	} BIT;
	} PERFTRG;
	char           wk5[4];
	unsigned long  TEXCLADDR;
	unsigned long  TEXCLDATA;
	unsigned long  TEXCLOFST;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long B : 8;
			unsigned long G : 8;
			unsigned long R : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long R : 8;
			unsigned long G : 8;
			unsigned long B : 8;
#endif
	} BIT;
	} COLKEY;
} st_drw2d_t;

typedef struct st_dsmif {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EDGE0 : 1;
			unsigned long EDGE1 : 1;
			unsigned long EDGE2 : 1;
			unsigned long EDGE3 : 1;
			unsigned long EDGE4 : 1;
			unsigned long EDGE5 : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long EDGE5 : 1;
			unsigned long EDGE4 : 1;
			unsigned long EDGE3 : 1;
			unsigned long EDGE2 : 1;
			unsigned long EDGE1 : 1;
			unsigned long EDGE0 : 1;
#endif
	} BIT;
	} DSCCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DIS0 : 1;
			unsigned long DIS1 : 1;
			unsigned long DIS2 : 1;
			unsigned long DIS3 : 1;
			unsigned long DIS4 : 1;
			unsigned long DIS5 : 1;
			unsigned long  : 26;
#else
			unsigned long  : 26;
			unsigned long DIS5 : 1;
			unsigned long DIS4 : 1;
			unsigned long DIS3 : 1;
			unsigned long DIS2 : 1;
			unsigned long DIS1 : 1;
			unsigned long DIS0 : 1;
#endif
	} BIT;
	} DSCHR;
} st_dsmif_t;

typedef struct st_dsmif0 {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FEN : 1;
			unsigned long CKDIR : 1;
			unsigned long  : 2;
			unsigned long CKDIV : 4;
			unsigned long CMSINC : 2;
			unsigned long  : 2;
			unsigned long CMDEC : 3;
			unsigned long  : 1;
			unsigned long CMSH : 4;
			unsigned long OCSINC : 2;
			unsigned long  : 2;
			unsigned long OCDEC : 3;
			unsigned long  : 1;
			unsigned long OCSH : 4;
#else
			unsigned long OCSH : 4;
			unsigned long  : 1;
			unsigned long OCDEC : 3;
			unsigned long  : 2;
			unsigned long OCSINC : 2;
			unsigned long CMSH : 4;
			unsigned long  : 1;
			unsigned long CMDEC : 3;
			unsigned long  : 2;
			unsigned long CMSINC : 2;
			unsigned long CKDIV : 4;
			unsigned long  : 2;
			unsigned long CKDIR : 1;
			unsigned long FEN : 1;
#endif
	} BIT;
	} DSCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long OCF0 : 1;
			unsigned long OCF1 : 1;
			unsigned long OCF2 : 1;
			unsigned long  : 1;
			unsigned long SCF0 : 1;
			unsigned long SCF1 : 1;
			unsigned long SCF2 : 1;
			unsigned long  : 1;
			unsigned long SUMERR : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long SUMERR : 1;
			unsigned long  : 1;
			unsigned long SCF2 : 1;
			unsigned long SCF1 : 1;
			unsigned long SCF0 : 1;
			unsigned long  : 1;
			unsigned long OCF2 : 1;
			unsigned long OCF1 : 1;
			unsigned long OCF0 : 1;
#endif
	} BIT;
	} DSSR;
	unsigned long  OCLTR;
	unsigned long  OCHTR;
	unsigned long  SCLTR;
	unsigned long  SCHTR;
	unsigned long  SUMLTR;
	unsigned long  SUMHTR;
	unsigned long  CDR0;
	unsigned long  CCDR0;
	unsigned long  TCDR0;
	unsigned long  OCDR0;
	unsigned long  CDR1;
	unsigned long  CCDR1;
	unsigned long  TCDR1;
	unsigned long  OCDR1;
	unsigned long  CDR2;
	unsigned long  CCDR2;
	unsigned long  TCDR2;
	unsigned long  OCDR2;
} st_dsmif0_t;

typedef struct st_dtc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char  : 4;
			unsigned char RRS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char RRS : 1;
			unsigned char  : 4;
#endif
	} BIT;
	} DTCCR;
	char           wk0[3];
	void          *DTCVBR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SHORT : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SHORT : 1;
#endif
	} BIT;
	} DTCADMOD;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DTCST : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char DTCST : 1;
#endif
	} BIT;
	} DTCST;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short VECN : 8;
			unsigned short  : 7;
			unsigned short ACT : 1;
#else
			unsigned short ACT : 1;
			unsigned short  : 7;
			unsigned short VECN : 8;
#endif
	} BIT;
	} DTCSTS;
	void          *DTCIBR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SQTFRL : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SQTFRL : 1;
#endif
	} BIT;
	} DTCOR;
	char           wk3[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short VECN : 8;
			unsigned short  : 7;
			unsigned short ESPSEL : 1;
#else
			unsigned short ESPSEL : 1;
			unsigned short  : 7;
			unsigned short VECN : 8;
#endif
	} BIT;
	} DTCSQE;
	unsigned long  DTCDISP;
} st_dtc_t;

typedef struct st_eccram {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RAMMOD : 2;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char RAMMOD : 2;
#endif
	} BIT;
	} ECCRAMMODE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ECC2ERR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ECC2ERR : 1;
#endif
	} BIT;
	} ECCRAM2STS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ECC1STSEN : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ECC1STSEN : 1;
#endif
	} BIT;
	} ECCRAM1STSEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ECC1ERR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ECC1ERR : 1;
#endif
	} BIT;
	} ECCRAM1STS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PRCR : 1;
			unsigned char KW : 7;
#else
			unsigned char KW : 7;
			unsigned char PRCR : 1;
#endif
	} BIT;
	} ECCRAMPRCR;
	char           wk0[3];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 3;
			unsigned long ECC2EAD : 12;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long ECC2EAD : 12;
			unsigned long  : 3;
#endif
	} BIT;
	} ECCRAM2ECAD;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 3;
			unsigned long ECC1EAD : 12;
			unsigned long  : 17;
#else
			unsigned long  : 17;
			unsigned long ECC1EAD : 12;
			unsigned long  : 3;
#endif
	} BIT;
	} ECCRAM1ECAD;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PRCR2 : 1;
			unsigned char KW2 : 7;
#else
			unsigned char KW2 : 7;
			unsigned char PRCR2 : 1;
#endif
	} BIT;
	} ECCRAMPRCR2;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TSTBYP : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char TSTBYP : 1;
#endif
	} BIT;
	} ECCRAMETST;
} st_eccram_t;

